In [2]:
import pandas as pd
import numpy as np
import re

In [1]:
def get_id(x):
    return re.split(pattern='id=|,', string=x)[1]

def get_title(x):
    return re.split(pattern='title=u|,', string=x)[2]

def get_idfs(x):
    return re.split(pattern="SparseVector\(256, ", string=x)[1][:-2]

In [3]:
data = pd.read_table('POV', header=None)
data.head()

                                                   0
0  Row(id=5597, title=u'Politics of Cyprus', _VAL...
1  Row(id=14668, title=u'Economy of Iraq', _VALUE...
2  Row(id=24400, title=u'Pair programming', _VALU...
3  Row(id=32783, title=u'Antisemitism and the New...
4  Row(id=38424, title=u'Bikram Yoga', _VALUE=u'{...

In [4]:
data.columns = ['raw']
data['id']=data['raw'].map(get_id)
data['title'] = data['raw'].map(get_title)
#data['idfs']=data['raw'].map(get_idfs)
data.drop(labels='raw', axis=1, inplace=True)
data.head()

      id                                 title
0   5597                  'Politics of Cyprus'
1  14668                     'Economy of Iraq'
2  24400                    'Pair programming'
3  32783  'Antisemitism and the New Testament'
4  38424                         'Bikram Yoga'

In [5]:
data.to_csv('POV.csv')